---
title: SolidCurveIntersection
classe: Autodesk.Revit.DB.SolidCurveIntersection
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# SolidCurveIntersection

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `solidCurveIntersection.IsValidObject` | Boolean |
| `SolidCurveIntersectionMode ResultType { get; }` | `solidCurveIntersection.ResultType` | SolidCurveIntersectionMode |
| `Int32 SegmentCount { get; }` | `solidCurveIntersection.SegmentCount` | Int32 |
| `Void Dispose()` | `solidCurveIntersection.Dispose()` | Void |
| `Curve GetCurveSegment(Int32)` | `solidCurveIntersection.GetCurveSegment(index)` | Curve |
| `CurveExtents GetCurveSegmentExtents(Int32)` | `solidCurveIntersection.GetCurveSegmentExtents(index)` | CurveExtents |
| `IEnumerator<Curve> GetEnumerator()` | `solidCurveIntersection.GetEnumerator()` | IEnumerator<Curve> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```